In [30]:
import pandas as pd
import datetime

In [29]:
# def numbers():
#     nums = []
#     for i in range(0, 101):
#         nums.append(i)
#     return nums

# id_series = numbers()

# def names():
#     names_sample = []
#     for i in range(0, 101):
#         name_sample = names.get_full_name()
#         names.append(name_sample)
#     return names

# name_series = names()
# print(name_series)

In [24]:
id_series = pd.Series([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
name_series = pd.Series(['joe', "bob", "jeff", "rick", "Carl", "Sam", "ashley", "jessica", "lexi", "angelica"])
salary_series = pd.Series([12345, 23456, 34567, 45678, 56789, 67890, 78901, 89012, 90123, 11234])
department_series = pd.Series(['engineering', 'comms', 'ops', 'engineering', 'comms', 'ops', 'engineering', 'comms', 'ops', 'engineering'])
employee_start_date = pd.Series([datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23), datetime.datetime(2000, 3, 23)])
employed_series = pd.Series([True, True, True, True, True, True, True, True, True, True,])

In [23]:
Employees = pd.DataFrame({
    'Names': name_series,
    "Salary": salary_series,
    'Department': department_series,
    'Employee Start Date': employee_start_date,
    'employed': employed_series
})

print(Employees)

      Names  Salary   Department Employee Start Date  employed
0       joe   12345  engineering          2000-03-23      True
1       bob   23456        comms          2000-03-23      True
2      jeff   34567          ops          2000-03-23      True
3      rick   45678  engineering          2000-03-23      True
4      Carl   56789        comms          2000-03-23      True
5       Sam   67890          ops          2000-03-23      True
6    ashley   78901  engineering          2000-03-23      True
7   jessica   89012        comms          2000-03-23      True
8      lexi   90123          ops          2000-03-23      True
9  angelica   11234  engineering          2000-03-23      True

In [18]:
Employees.query('Salary >= 50000')

     Names   Salary   Department Employee Start Date employed
4     Carl  56789.0        comms          2000-03-23     True
5      Sam  67890.0          ops          2000-03-23     True
6   ashley  78901.0  engineering          2000-03-23     True
7  jessica  89012.0        comms          2000-03-23     True
8     lexi  90123.0          ops          2000-03-23     True

In [15]:
Employees.iloc[1]

Names                                  bob
Salary                             23456.0
Department                           comms
Employee Start Date    2000-03-23 00:00:00
employed                              True
Name: 1, dtype: object

In [16]:
Employees.groupby(department_series).count()

             Names  Salary  Department  Employee Start Date  employed
comms            3       3           3                    3         3
engineering      4       4           4                    4         4
ops              3       3           3                    3         3